Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t
Struct for registering interest in different types of tolerations.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.NearestObject
Toleration to nearest object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.AllObjects
Toleration to all objects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.NearestPointOnLine
Toleration to nearest point on line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.AllPointsOnLine
Toleration to all points on line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.NearestPointOnFace
Toleration to nearest point on face.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.AllPointsOnFace
Toleration to all points on face.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t.SnappedPoint
Snapped point toleration.